/*******************************************************************************************************
**------------------------------------------------------------------------------------------------------
** 文件	: 	usart3_ZigBee.c			
** 版本	: 	v1.0 
**------------------------------------------------------------------------------------------------------
** 描述	:	
		本文件为ZigBee驱动程序
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#ifndef __USRAT3_ZIGBEE_H
#define __USRAT3_ZIGBEE_H 

#include "config.h"

#define USART3_MAX_RECV_LEN		600					//最大接收缓存字节数
#define USART3_MAX_SEND_LEN		600					//最大发送缓存字节数
#define USART3_RX_EN 			1					//0,不接收;1,接收.

extern u8 USART3_RX_BUF[USART3_MAX_RECV_LEN]; 		//接收缓冲,最大USART3_MAX_RECV_LEN字节
extern u8 USART3_TX_BUF[USART3_MAX_SEND_LEN]; 		//发送缓冲,最大USART3_MAX_SEND_LEN字节
extern vu16 USART3_RX_STA;   	
extern u8 wait_time;
extern u8 ElecNum;  //用电器编号

void uart3_ZigBee_init(u32 bound);
void u3_printf(char* fmt,...);
void Disp_Sta(void);
#endif

/********************************************************************************************************
**                            End Of File
********************************************************************************************************/
