/*******************************************************************************************************
**------------------------------------------------------------------------------------------------------
** 文件: Button.h 
** 版本: v1.0
**------------------------------------------------------------------------------------------------------
** 描述:
**      按键检测文件
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#ifndef __BUTTON__H__
#define __BUTTON__H__

#define BUTTON_FILTER_TIME 	10				// 10ms 按键消抖事件
#define BUTTON_LONG_TIME 	500				// 1s，长按事件时间

typedef struct
{
	unsigned char  (*IsKeyDownFunc)(void); 	// 函数指针、按键按下的判断函数
	unsigned char 	wFilterCount;			// 滤波器计数器 
	unsigned char 	wFilterTime;			// 滤波时间(最大255,表示2550ms) 	
	unsigned short	wLongCount;				// 长按计数器 
	unsigned short	wLongTime;				// 按键按下持续时间, 0表示不检测长按 	
	unsigned char  	byState;				// 按键当前状态（按下还是弹起） 	
	unsigned char 	byKeyCodeUp;			// 按键弹起的键值代码, 0表示不检测按键弹起 
	unsigned char 	byKeyCodeDown;			// 按键按下的键值代码, 0表示不检测按键按下 
	unsigned char 	byKeyCodeLong;			// 按键长按的键值代码, 0表示不检测长按 
}Button_t;

typedef enum
{
	KEY_NONE = 0,							// 无按键事件
	KEY1_DOWN,	KEY1_UP , KEY1_LONG,		// KEY1键 按下、弹起、长按 事件
	KEY2_DOWN,	KEY2_UP , KEY2_LONG,		// KEY2键 按下、弹起、长按 事件
	KEY3_DOWN,	KEY3_UP , KEY3_LONG,		// KEY3键 按下、弹起、长按 事件
	KEY4_DOWN,	KEY4_UP , KEY4_LONG,		// KEY4键 按下、弹起、长按 事件
}Key_em;


/*******************************************************************************************************
** 函数: ButtonInit,Button初始化
**------------------------------------------------------------------------------------------------------
** 参数: void
** 返回: void
********************************************************************************************************/
void ButtonInit(void);
/*******************************************************************************************************
** 函数: ButtonProj,按键处理函数
**------------------------------------------------------------------------------------------------------
** 参数: void
** 返回: void
********************************************************************************************************/
void ButtonProj(void);
/*******************************************************************************************************
** 函数: ButtonProj,按键处理函数
**------------------------------------------------------------------------------------------------------
** 参数: void
** 返回: void
********************************************************************************************************/
int ButtonGetKey(void);

unsigned char IsKey1Down(void);
unsigned char IsKey2Down(void);
unsigned char IsKey3Down(void);
unsigned char IsKey4Down(void); 
#endif
/********************************************************************************************************
**                            End Of File
********************************************************************************************************/
